# QR 코드와 URL 단축하기
QR코드와 URL 단축 서비스는 URL 주소를 좀 더 접근이 편리하도록 변환하는 데 목적이 있다.
QR코드는 코드에 직접 URL를 삽입할 수도 있지만, 관리목적으로 URL 단축 서비스와 동일하게 동작한다.
특정 서버로 쿼리가 날라가고, 서버에서 리다이렉션할 주소를 던져주는 방식이다.
이와 같이 서버를 경유하는 경우, 접속 히스토리를 관리할 수 있고, 트래픽을 체크할 수 있어서 유용하다.

하지만 서버를 경유하기 때문에 아무리 짧은 시간이더라고 하더라도, 레이턴시가 생기기 마련이다.
특히 미국에서 한국의 다음, 네이버 서비스를 이용할 경우 0.1초 수준의 레이턴시는 감안해야 한다.

## bit.ly
초창기부터 서비스되던 곳으로 custom url을 지원하여 사용하였으나, 한번 생성 후 변경이 여의치 않았다.
Custom URL은 bit.ly/(임의코드) 에서 임의로 생성되는 코드 부분을 특정한 문자로 대치할 수 있다.
물론 다른 사람이 이미 선점한 경우에는 사용할 수 없다.

## goo.gl
구글 역시 일찍이 서비스를 시작하였다. 구글이라는 도메인이 친숙한 반면, 고급 기능은 전혀 없고, 기본 기능만 제공하고 있어 다소 아쉬움이 있다.

## URL 단축서비스의 단점
속도는 사실 큰 문제가 아니나, 보안 문제 때문에 사용이 꺼려지는 측면이 있다. URL를 확인할 수 없으므로,
신뢰할 수 있는 사이트인지 알기가 어렵고, 클릭 시 특정 사이트로 바로 리다이렉션 되므로, 부지불식간에
취약점을 통한 해킹에 노출될 우려가 있다.


또한 QR코드는 한국의 다음, 네이버 앱에서 기본적으로 스캐너 기능을 제공하는 반면,
미국에서는 QR코드를 읽기 위해서 스캐너 앱을 설치해야 하는 불편함이 있다.
